{
  "mainContent": {
    "announce": {
      "text": "游 춰NUEVA FUNCI칍N! Soporte Mejorado de M칰ltiples Capas con Agrupaci칩n Avanzada 춰Disponible Ahora! 춰Haz Clic para Saber M치s! 游꿢",
      "url": "/documentation"
    },
    "intro": {
      "title": "Presentando GeoDa 1.22",
      "content": [
        "GeoDa es una herramienta de software gratuita y de c칩digo abierto que sirve como introducci칩n a la ciencia de datos espaciales. Est치 dise침ada para facilitar nuevas perspectivas del an치lisis de datos mediante la exploraci칩n y modelado de patrones espaciales.",
        "GeoDa fue desarrollado por el Dr. Luc Anselin y su equipo. El programa proporciona una interfaz gr치fica y f치cil de usar para m칠todos de an치lisis exploratorio de datos espaciales (ESDA), como estad칤sticas de autocorrelaci칩n espacial para datos agregados (varios miles de registros), y an치lisis b치sico de regresi칩n espacial para datos de puntos y pol칤gonos (decenas de miles de registros). Para trabajar con big data en GeoDa, primero debe agregarse a unidades areales.",
        "Desde su lanzamiento inicial en febrero de 2003, el n칰mero de usuarios de GeoDa ha aumentado exponencialmente a m치s de 520,000 (junio de 2022). Esto incluye usuarios de laboratorio en universidades como Harvard, MIT y Cornell. La comunidad de usuarios y la prensa abrazaron el programa con entusiasmo, llam치ndolo una 'herramienta anal칤tica enormemente importante', un 'software muy fino' y un 'desarrollo emocionante'.",
        "La 칰ltima versi칩n 1.22 contiene soporte multi-capa, varias nuevas caracter칤sticas de cl칰ster local, incluyendo mapas de cl칰ster local Geary univariados y multivariados, redcap, skater, clustering espectral y max-p, y mapas de conteo de uni칩n local para datos categ칩ricos. Tambi칠n implementa varias t칠cnicas cl치sicas de cl칰ster no espacial (an치lisis de componentes principales, k-means, y clustering jer치rquico) implementadas en la Biblioteca C Clustering de Hoon et al. (2013), as칤 como HDBScan.",
        "Un nuevo libro de trabajo est치 en desarrollo. Mientras tanto, aqu칤 hay recursos interinos, incluyendo una descripci칩n general de las caracter칤sticas en 1.22."
      ],
      "links": [
        {
          "text": "Dr. Luc Anselin",
          "href": "https://en.wikipedia.org/wiki/Luc_Anselin"
        },
        {
          "text": "equipo",
          "href": "https://spatial.uchicago.edu/directories/full/team"
        },
        {
          "text": "mapas de cl칰ster local Geary univariados y multivariados",
          "href": "/docs/LA_multivariateGeary1.pdf",
          "external": true
        },
        {
          "text": "Biblioteca C Clustering de Hoon et al. (2013)",
          "href": "https://bonsai.hgc.jp/~mdehoon/software/cluster/cluster.pdf",
          "external": true
        },
        {
          "text": "aqu칤 hay recursos interinos",
          "href": "./documentation"
        }
      ],
      "youtubeVideo": {
        "src": "https://www.youtube.com/embed/--8vhhmpgdM",
        "width": "360",
        "height": "215"
      }
    },
    "slideshow": {
      "title": "GeoDa 1.22",
      "description": "GeoDa funciona en Windows, MacOSX y Linux (Ubuntu)",
      "slides": [
        {
          "image": "img/intro1.png",
          "alt": "Mac OSX El Capitan",
          "caption": "Mac OSX El Capitan"
        },
        {
          "image": "img/intro2.png",
          "alt": "Windows 7/8/10",
          "caption": "Windows 7/8/10"
        },
        {
          "image": "img/intro3.png",
          "alt": "Ubuntu 14.04",
          "caption": "Ubuntu 14.04"
        }
      ]
    },
    "sections": [
      {
        "id": "intro-data-formats",
        "title": "GeoDa Ahora Soporta M치s Formatos de Datos Espaciales",
        "content": "GeoDa ahora soporta una mayor variedad de datos vectoriales en diferentes formatos (haz clic aqu칤 para ver los detalles): Puedes trabajar con shapefiles, geodatabases, GeoJSON, MapInfo, GML, KML, y otros formatos de datos vectoriales soportados por la biblioteca GDAL. El programa tambi칠n convierte coordenadas en formato de tabla (.csv, .dbf, .xls, .ods) a uno de estos formatos de datos espaciales y convierte datos entre diferentes formatos de archivo (como .csv a .dbf o shapefile a GeoJSON). Seleccionar un subconjunto y exportarlo como un nuevo archivo ahora tambi칠n es posible.",
        "image": "img/dataformats.png",
        "imageAlt": "Formatos de Datos",
        "links": [
          {
            "text": "aqu칤",
            "href": "./formats"
          }
        ]
      },
      {
        "id": "intro-multi-layer",
        "title": "춰Ahora Con Soporte Multi-capa!",
        "content": "Por primera vez, ahora puedes cargar capas adicionales en GeoDa para prop칩sitos de visualizaci칩n. El an치lisis seguir치 realiz치ndose en la capa que cargues primero. En este ejemplo, el mapa muestra el acceso al transporte desde bloques de viviendas, con las ubicaciones de las estaciones de transporte como una capa adicional.",
        "image": "img/multi-layer.png",
        "imageAlt": "Soporte Multi-capa"
      },
      {
        "id": "intro-esda",
        "title": "Explora Resultados Estad칤sticos a Trav칠s de Mapas y Gr치ficos Vinculados",
        "content": "A diferencia de los programas que visualizan datos crudos en mapas, GeoDa se enfoca en explorar los resultados de pruebas estad칤sticas y modelos a trav칠s de mapas y gr치ficos vinculados.",
        "image": "img/esda.png",
        "imageAlt": "ESDA"
      },
      {
        "id": "intro-time",
        "title": "Analiza Patrones Espaciales y Temporales a Trav칠s de Vistas Vinculadas",
        "content": "Ahora puedes agrupar la misma variable a trav칠s de per칤odos de tiempo en el nuevo Editor de Tiempo para explorar patrones estad칤sticos a trav칠s del espacio y tiempo. Luego explora los resultados a medida que las vistas cambian con el tiempo usando el Reproductor de Tiempo.",
        "image": "img/time.png",
        "imageAlt": "An치lisis de Tiempo"
      },
      {
        "id": "intro-ui",
        "title": "Verifica Resultados de Mapas con Mapas Base",
        "content": "Si tus datos espaciales est치n proyectados (archivo .prj), ahora puedes agregar un mapa base a cualquier vista de mapa, incluyendo mapas de cl칰ster, para mejor orientaci칩n y para verificar resultados.",
        "image": "img/intro4.png",
        "imageAlt": "Mapa Base",
        "imageWidth": "832"
      },
      {
        "id": "intro-avg",
        "title": "Compara Promedios a Trav칠s del Tiempo y Espacio",
        "content": "Un nuevo Gr치fico de Promedios compara valores que se promedian a lo largo del tiempo y/o espacio y prueba si las diferencias en estas medias son significativas. Por ejemplo, primero selecciona si quieres comparar medias de observaciones seleccionadas vs. no seleccionadas en el mismo per칤odo de tiempo o comparar todas las observaciones para diferentes per칤odos de tiempo. Una prueba b치sica pre-post/impacto-control luego indica si tus resultados cambiaron a lo largo del tiempo y espacio (usando una prueba F y prueba de diferencia en diferencias).",
        "image": "img/avgchart.png",
        "imageAlt": "Gr치fico de Promedios"
      },
      {
        "id": "intro-sp-matrix",
        "title": "Detecta Relaciones en Espacio Multivariado",
        "content": "Una matriz de gr치ficos de dispersi칩n te permite explorar m칰ltiples correlaciones bivariadas a la vez. En este ejemplo, las pendientes de regresi칩n para precintos policiales seleccionados, no seleccionados y todos en San Francisco se muestran para explorar relaciones entre cuatro tipos de crimen.",
        "image": "img/scatter_matrix.png",
        "imageAlt": "Matriz de Dispersi칩n"
      },
      {
        "id": "intro-diff-mi",
        "title": "Encuentra Cl칰steres Espaciales Estad칤sticamente Significativos",
        "content": "GeoDa ha soportado durante mucho tiempo pruebas locales uni y bivariadas de autocorrelaci칩n espacial como Moran local. Ahora el programa tambi칠n incluye G/G* local, y una variedad de estad칤sticas de conteo de uni칩n local para datos categ칩ricos. En este ejemplo, mapas de cl칰ster Moran local identifican mayor % de votos GOP en 치reas centrales de EE.UU. tanto en las elecciones presidenciales de 2012 como 2016 (izquierda). El mapa de conteo de colocalizaci칩n (arriba derecha) muestra cu치les de los valores de cl칰ster alto-alto en ambos a침os se superpusieron en el espacio mientras que el mapa Moran local diferencial revela cl칰steres en diferencias de % de puntos entre 2016 y 2012 (abajo derecha).",
        "image": "img/Lisa.png",
        "imageAlt": "LISA"
      },
      {
        "id": "intro-clusters",
        "title": "Compara un Conjunto de T칠cnicas de Cl칰ster Espacialmente Restringidas",
        "content": "GeoDa ahora tiene muchas t칠cnicas nuevas para identificar cl칰steres con restricciones espaciales, incluyendo skater, redcap, max-p, k-means, k-medians, k-medoids, y clustering espectral. Aqu칤 hay algunos ejemplos de c칩mo se agrupan los residentes blancos nacidos en el extranjero, residentes hispanos nacidos en el extranjero y rentas mensuales medianas en 2008-2009 en Nueva York.",
        "image": "img/sc_clusters.png",
        "imageAlt": "Cl칰steres Espaciales"
      },
      {
        "id": "intro-diff-mi-2",
        "title": "Determina si los Cambios a lo Largo del Tiempo Est치n Espacialmente Agrupados",
        "content": "Usa una prueba global o local de Moran's I Diferencial para averiguar si el cambio de una variable a lo largo del tiempo en una ubicaci칩n dada est치 estad칤sticamente relacionado con el de sus vecinos. Por ejemplo, este mapa de cl칰ster local (LISA) muestra puntos calientes en Nueva York con cambios m치s grandes en la proporci칩n de ni침os entre 2002 y 2008 (y puntos fr칤os con cambios m치s peque침os).",
        "image": "img/DiffMI.png",
        "imageAlt": "Moran's I Diferencial"
      },
      {
        "id": "intro-multivariate",
        "title": "Prueba si M칰ltiples Variables Est치n Agrupadas en el Espacio",
        "content": "Luc Anselin (2017) recientemente extendi칩 la c de Geary con un nuevo indicador local de asociaci칩n espacial. Esto se aplica al conjunto de datos cl치sico de 'estad칤sticas morales' de Francia (Guerry, 1833) para mostrar concentraciones espaciales significativas altas y bajas de alfabetizaci칩n (mapa izquierdo) y asociaciones significativas de crimen de propiedad y alfabetizaci칩n (mapa derecho).",
        "image": "img/localGeary.png",
        "imageAlt": "Geary Local",
        "links": [
          {
            "text": "Luc Anselin (2017)",
            "href": "/docs/LA_multivariateGeary1.pdf",
            "external": true
          }
        ]
      },
      {
        "id": "intro-nonspatial",
        "title": "Mapea Patrones de Estad칤sticas de Cl칰ster No Espaciales",
        "content": "Ahora puedes mapear patrones de varias t칠cnicas cl치sicas de cl칰ster no espaciales, incluyendo an치lisis de componentes principales (mapas izquierdos), k-means (arriba derecha), y clustering jer치rquico (abajo derecha) y escalado multidimensional. Usando los mismos datos que en el ejemplo anterior, los mapas de abajo muestran cl칰steres locales de crimen de propiedad, alfabetizaci칩n y suicidio.",
        "image": "img/nonspatial_clusters.png",
        "imageAlt": "Cl칰steres No Espaciales"
      },
      {
        "id": "intro-corr",
        "title": "Encuentra el Umbral Donde Termina la Correlaci칩n Espacial",
        "content": "Una prueba no param칠trica de autocorrelaci칩n espacial (correlograma) ahora est치 disponible para determinar umbrales de distancia cuando los valores de pares vecinos ya no est치n correlacionados.",
        "image": "img/corr.png",
        "imageAlt": "Correlograma"
      },
      {
        "id": "intro-cat",
        "title": "Explora el Impacto de la Categorizaci칩n Flexible de Datos",
        "content": "Con el nuevo editor de categor칤as, puedes explorar qu칠 tan sensibles son tus resultados a cambios en los umbrales que categorizan tus datos. En este ejemplo los umbrales en el mapa condicional (derecha) se basan en las categor칤as que se pueden ajustar en el editor de categor칤as (izquierda).",
        "image": "img/cat_editor.png",
        "imageAlt": "Editor de Categor칤as"
      }
    ]
  },
  "dependencies": {
    "title": "Dependencias",
    "description": "GeoDa se lanza bajo una licencia GPL. Se basa en varias bibliotecas de c칩digo abierto y archivos de c칩digo fuente. A continuaci칩n se muestra la lista de los proyectos clave que nos gustar칤a agradecer.",
    "items": [
      {
        "name": "Bibliotecas GDAL, versi칩n 1.10",
        "license": "Licencia de c칩digo abierto estilo X/MIT",
        "authors": "Muchos",
        "link": "https://www.gdal.org/"
      },
      {
        "name": "Bibliotecas Boost, versi칩n 1.53",
        "license": "Licencia de Software Boost - Versi칩n 1.0",
        "authors": "Muchos",
        "link": "https://www.boost.org/"
      },
      {
        "name": "Biblioteca GUI Multiplataforma wxWidgets, versi칩n 2.9.4",
        "license": "La Licencia de Biblioteca wxWindows",
        "authors": "Julian Smart, Robert Roebling, y otros",
        "link": "https://www.wxwidgets.org/"
      },
      {
        "name": "Bibliotecas de 츼lgebra Lineal CLAPACK, versi칩n 3.2.1",
        "license": "Personalizada por la Universidad de Tennessee",
        "authors": "Muchos",
        "link": "https://www.netlib.org/clapack/"
      },
      {
        "name": "Biblioteca de Vecinos M치s Cercanos Aproximados, versi칩n 0.1",
        "license": "Ver kNN/AHH.h en archivos de c칩digo fuente incluidos",
        "authors": "Sunil Arya y David Mount",
        "link": "https://www.cs.umd.edu/~mount/ANN/",
        "note": "C칩digo fuente completo de la versi칩n 0.1 incluido en el directorio kNN"
      },
      {
        "name": "C칩digo fuente FastArea.c++",
        "license": "Desconocida",
        "authors": "Daniel Sunday",
        "link": "https://jgt.akpeters.com/papers/Sunday02/FastArea.html",
        "note": "El c칩digo fuente para las funciones findArea y ComputeArea2D est치n en el archivo GenGeomAlgs.h de FastArea.c++ en Journal of Graphics Tools, 7(2):9-13, 2002"
      },
      {
        "name": "C칩digo fuente logger.h",
        "license": "Licencia de Software Boost - Versi칩n 1.0",
        "authors": "Seweryn Habdank-Wojewodzki",
        "link": "https://accu.org/index.php/journals/1304",
        "note": "Hemos copiado el c칩digo fuente para logger.h y lo hemos modificado ligeramente para trabajar con wxString"
      },
      {
        "name": "C칩digo fuente nullstream.h",
        "license": "Ver logger.h en archivos de c칩digo fuente incluidos",
        "authors": "Maciej Sobczak",
        "link": "https://www.msobczak.com/"
      },
      {
        "name": "La Biblioteca C Clustering",
        "license": "Licencia Python",
        "authors": "Hoon, Michiel de, Seiya Imoto, Satoru Miyano. (2013). The University of Tokyo, Institute of Medical Science, Human Genome Center",
        "link": "https://bonsai.hgc.jp/~mdehoon/software/cluster/cluster.pdf"
      }
    ]
  },
  "acknowledgments": {
    "title": "Agradecimientos",
    "content": "El desarrollo de GeoDa ha sido apoyado m치s recientemente por la National Science Foundation, los National Institutes of Health, el National Institute of Justice, y la Agency for Healthcare Research and Quality."
  },
  "support": {
    "title": "Soporte",
    "content": "Actualmente estamos actualizando la documentaci칩n para reflejar las nuevas caracter칤sticas en GeoDa 1.22. La lista de correo Openspace soporta preguntas t칠cnicas sobre GeoDa.",
    "links": [
      {
        "text": "documentaci칩n",
        "href": "./documentation"
      },
      {
        "text": "Lista de correo Openspace",
        "href": "./support"
      }
    ]
  },
  "license": {
    "title": "Licencia",
    "content": "GeoDa usa una Licencia GPL (Licencia P칰blica General).",
    "links": [
      {
        "text": "Licencia GPL (Licencia P칰blica General)",
        "href": "https://www.gnu.org/licenses/gpl-3.0.en.html",
        "external": true
      }
    ]
  },
  "contact": {
    "title": "Contacto",
    "content": "쯇reguntas? Cont치ctanos.",
    "links": [
      {
        "text": "nosotros",
        "href": "mailto:spatial@uchicago.edu"
      }
    ]
  },
  "donate": {
    "title": "Donar",
    "content": "Ay칰danos a mantener GeoDa gratuito contribuyendo aqu칤. 춰Gracias por apoyar el software espacial gratuito y de c칩digo abierto!",
    "links": [
      {
        "text": "aqu칤",
        "href": "https://giving.uchicago.edu/site/Donation2?1838.donation=form1&df_id=1838&mfc_pref=T&set.Designee=1901",
        "external": true
      }
    ],
    "image": "img/donate.png",
    "imageAlt": "Donar a GeoDa"
  }
} 